src/xml/find-items.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
    <soap:Body>
        <FindItem xmlns="http://schemas.microsoft.com/exchange/services/2006/messages" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" Traversal="Shallow">
            <ItemShape>
                <t:BaseShape>AllProperties</t:BaseShape>
                <t:AdditionalProperties>
                    <t:FieldURI FieldURI="item:Subject"/>
                    <t:FieldURI FieldURI="item:DateTimeReceived"/>
                    <t:FieldURI FieldURI="message:IsRead"/>
                    <t:FieldURI FieldURI="message:From"/>
                </t:AdditionalProperties>
            </ItemShape>
            <IndexedPageItemView MaxEntriesReturned="100" Offset="0" BasePoint="Beginning"/>
            <Restriction>
                <t:IsEqualTo>
                    <t:FieldURI FieldURI="message:IsRead"/>
                    <t:FieldURIOrConstant>
                        <t:Constant Value="false"/>
                    </t:FieldURIOrConstant>
                </t:IsEqualTo>
            </Restriction>
            <ParentFolderIds>
                <t:DistinguishedFolderId Id="root"/>
                <t:DistinguishedFolderId Id="inbox"/>
            </ParentFolderIds>
        </FindItem>
    </soap:Body>
</soap:Envelope>